{"items":[{"id":1655776,"body":"<div>\n <p><img alt=\"The MediaCorp actress recalls the time she ended things with her two-timing university ex-boyfriend\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1655760\/1423792118000\/201502130944-jean-jpg-data.jpg\" \/><br \/><\/p>\n <p><strong>Video: Tay Yixuan<\/strong><\/p>\n <p>Jeanette Aw may be notoriously tight-lipped about her current relationship with a Caucasian man named Marcus, but when it comes to her previous boyfriend, whom she dated in her university days, she seems willing to spill a little bit more – even about the difficult bits.<\/p>\n <p>“It was a painful relationship, but I can talk about it now because it doesn’t bother me anymore,” she shared with us during an interview at the press conference for <em>Let It Go<\/em>, in which she plays a blogger who teaches her readers how to find happiness again after a breakup. The upcoming Channel U drama is produced by WaWa Pictures and was co-written by Jesseca Liu. “He was actually seeing other girls at the same time, but it didn’t occur to me to confront him (about them) because I was so blindly in love. (<em>laughs<\/em>)”<\/p>\n <p>She went on to admit that this fling turned her into someone she is not: a girl who was constantly crying in one corner, never dared to speak up and stand up for herself, and who spent less and less time with her friends in favour of her beau. “It’s like those girls you see in TV dramas that make you go ‘Why are you so stupid!’” she said with a chuckle.<\/p>\n <p>Thankfully, Jeanette eventually came to her senses and ended things with the cheating chap, whom she met in her dance group, after a year and a half of being together. However, really letting go of it emotionally was another hurdle.<\/p>\n <p>“It took a long time for me to get over that relationship, I thought I was really in love,” she said. “Filming in Taiwan for a few months gave me some time to heal away from Singapore, but it wasn’t until many years later that I could let myself be in another relationship. It took some time to find myself and to build up my confidence again.”<\/p>\n <p><img alt=\"Jeanette and Elvin pose with their adorable and fluffy co-star Ace the chinchilla\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1655758\/1423792299000\/201502130944-ace-jpg-data.jpg\" \/><br \/><\/p>\n <p>Today, she is much happier with her mystery man, but she claims that there are no wedding plans at the moment. Instead, she will be busy gearing up for the launch of her second book, which will contain her illustrations, and an art exhibition in May this year. “There are lots of good things happening, but it’s not what you think! (<em>laughs<\/em>)”<\/p>\n <p>That isn’t the only thing Jeanette has to look forward to in the coming months: in April, she will finally be conferred the All-Time Favourite Artiste award at the 2015 Star Awards with Vivian Lai, after being successfully voted into the Top 10 Most Popular Female Artistes rankings for a decade. “I’m very happy,” she beamed. “The All-Time Favourite award is actually from my fans, so I treasure it very much.”<\/p>\n <p>However, the cause for celebration is also marred by complaints from devotees who are dissatisfied with her absence from <a href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/sa2015-newcomers-aloysius-pang-and-carrie-wong-land-double-nominations\/ar-AA8UT2H\">this year’s list of Best Actress nominees<\/a>, especially given her <a href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/hits-and-misses-of-the-journey-tumultuous-times\/ss-BBhqrU5#image=4\">highly-lauded performance in <em>The Journey: Tumultuous Times<\/em><\/a>. While she declined to divulge her own thoughts on missing out on a nod, she said she was thankful for her fans’ care and encouragement, and wished only for them to just enjoy her dramas from now on.<\/p>\n <p><strong>Elvin Ng is the “very sentimental, irritating, romantic sort”<\/strong><\/p>\n <p><strong><img alt=\"Elvin Ng will fight until his very last breath before giving up on a relationship\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1655762\/1423792180000\/201502130944-elvin-jpg-data.jpg\" \/><\/strong><br \/><\/p>\n <p>A self-proclaimed “warrior” when it comes to love, Elvin admitted that he is the kind of person who will fight until his very last breath before throwing in the towel on a relationship. “Whatever you may have seen (a character do to try and salvage a relationship) in a Channel 8 drama, I might have done it – except jump from a building,” he chortled. “I’m the very sentimental, irritating, romantic sort. (<em>laughs<\/em>)”<\/p>\n <p>In fact, Elvin is so sentimental, he doesn’t even throw away items belonging to his ex-partners, unlike what his co-star and onscreen love interest Jeanette confessed to doing, saying that they hold &quot;good memories&quot; for him.<\/p>\n <p>When asked to recount the worst of his three breakups, Elvin admitted – albeit with an air of half-jest – that as an “emotional wreck”, all of them were “the worst thing that have ever happened” to him. That said, the most recent one, which happened over two years ago, stands out because he spent time abroad to write his book <em>Our Epic Little Lives<\/em> afterwards.<\/p>\n <p>“I remember walking the streets of London alone and feeling emo,” he recounted. “Then at Christmas, a message came, and when I got back to Singapore, we got back together for another week or so before realising that it wasn’t going to work out.” Oh well, at least he tried again, right?<\/p>\n <p><strong>Related: <\/strong><a href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/story\/it%E2%80%99s-love-over-money-for-elvin-ng\/ar-BBg58ZD\">It’s love over money for Elvin Ng<\/a><\/p>\n <p><strong>Cavin Soh’s son: a makeup aficionado at heart?<\/strong><\/p>\n <p><strong><img alt=\"Elvin Ng and a beautified Cavin Soh in 'Let It Go'\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1655756\/1423792201000\/201502130944-cavin-jpg-data.jpg\" \/><\/strong><br \/><\/p>\n <p>If anyone still doesn’t believe there can be joy after a split, just ask Cavin Soh. Although none of his past breakups were “happy” per se, they did lead him to wed wife Serena Yeo, which then led to the births of his two children Kayden and Bethany, who are turning 4 and 2 respectively this year.<\/p>\n <p>“Before I go to work, my daughter will waddle up to me to say goodbye and ask for a hug and cuddles,” said the proud papa, mimicking his toddler’s adorable actions. “So I see my ‘post-breakup happiness’ in her.”<\/p>\n <p>In <em>Let It Go<\/em>, the amicable multi-hyphenate takes a hilarious turn as an effeminate (but straight) makeup artist, complete with kohl-rimmed eyes, false eyelashes and sassy hand gestures. According to him, it took up to an hour to beautify him every time – longer than female leads Jeanette and Mindee Ong.<\/p>\n <p>A year before he took on his guyliner-wearing character, Cavin had another brush with cosmetics in a department store with little curious Kayden, but that incident left him quite concerned. “He pointed to the eyeshadows and lipsticks and said, ‘Papa, I like!’ and I thought to myself, ‘Oh my god’,” recalled Cavin. “I asked him why he liked them and he said he didn’t know, so I’m honestly a bit worried right now. (<em>laughs<\/em>)”<\/p>\n <p><em>Catch Let It Go every Monday to Friday at 10pm on Channel U, starting February 23<\/em><\/p>\n <p><strong>WATCH:&nbsp;<\/strong><a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/video\/watch\/watch-jeanette-aw-and-elvin-ng-reveal-things-about-their-past-relationships-%E7%9C%8B%E7%9C%8B%E6%AC%A7%E8%90%B1%E5%92%8C%E9%BB%84%E4%BF%8A%E9%9B%84%E5%9D%A6%E8%AF%9A%E4%BB%96%E4%BB%AC%E4%BB%A5%E5%89%8D%E7%9A%84%E6%81%8B%E7%88%B1%E7%BB%8F%E5%8E%86\/vi-481ffdde-f84d-3aa2-8aca-42f6561c8fc6\">Jeanette Aw &amp; Elvin Ng reveal things about their past relationships<\/a><\/p>\n<\/div>","author":"Tammi Tan","title":"Jeanette Aw and the terrible, horrible, no good, very bad breakup","keywords":"","abstractText":"The MediaCorp actress recalls the time she ended things with her two-timing university ex-boyfriend","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20150213T095338+0800","published":"20150213T095338+0800"}},{"id":1643798,"body":"<div>\n <p><img alt=\"Zheng Ge Ping speaks out against bodybuilding supplements scam\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1643786\/1423324959000\/201502080000-zgp-jpg-data.jpg\" \/><br \/><\/p>\n <p>Just five months after Chen Li Ping shot down fake reports that she successfully slimmed down with the help of garcinia cambogia diet pills, another MediaCorp artiste has unwittingly been featured in an online post promoting questionable health goods.<\/p>\n <p>At around 5pm yesterday, Zheng Ge Ping’s friend showed him a website called Men’s Fitness alleging that the “hunkle” relied on two kinds of bodybuilding supplements, called Nitric Max Muscle and Anabolic Rx24, to “carve his body into tip top shape in only a few months”, followed by links for readers to purchase the products.<\/p>\n <p>However, the 50-year-old has never heard of them in his life.<\/p>\n <p>“It is a scam that uses people’s photos to cheat their customers – it’s despicable!” he exclaimed over a phone interview last night after alerting us to the accusation. The article also claims that Hong Kong star Nick Cheung and Taiwanese heartthrob Eddie Peng popped the pills to beef up for boxing film <em>Unbeatable<\/em>.<\/p>\n <p>Right now, the only supplements Ge Ping takes are antioxidants, fish oil and protein powder. He eats clean as much as he can, and preserves his famous physique by working out at least three times a week. “Maintaining is not easy because I’m getting older (and) I won’t deny that I’m looking for a shortcut, but I don’t think this is it,” he said, referring to Nitric Max Muscle and Anabolic Rx24, which house the so-called benefits of helping men “burn fat and get ripped in less than a month”.<\/p>\n <p><img alt=\"The shady &quot;Men's Fitness&quot; website that made false claims about Ge Ping's fit physique\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1643788\/1423324947000\/201502080000-website-jpg-data.jpg\" \/><br \/><\/p>\n <p>When asked why he thinks he was picked to be included in the suspicious piece, Ge Ping ventured a guess that the scammers were trying to ride on the success of his book <em>Star Fitness<\/em>, which was Popular’s top-selling fitness publication of 2013. “In a way, I guess I’m quite flattered!” he candidly admitted with a hearty laugh.<\/p>\n <p>Revealing that he initially considered ignoring the matter, the Star Awards 2007 Best Actor changed his mind when he thought of those who might gullibly fall victim to the hoax, putting them at risk of unauthorised credit card charges from paying for the product and unpleasant side effects from taking it.<\/p>\n <p>&quot;I contemplated this for an hour before deciding that I should warn people to be careful,” he shared, urging those who have already gotten their hands on the two products to have them tested at the Health Sciences Authority for any malicious ingredients, and for others to only buy such items from trusted brands and companies.<\/p>\n <p>At the moment, Ge Ping will not pursue any legal action against the perpetrators as it will be a long and expensive process, but he does have a message for the fraudulent internet tricksters: “Beware of karma. (It’s better to run) an honest business.”<\/p>\n <p>Men’s Health magazine, which the Men’s Fitness website claims to endorse the supplements, previously stepped up to clarify that they do not advocate these products and to inform the public that such campaigns are, indeed, a scam.<\/p>\n<\/div>","author":"Tammi Tan","title":"Zheng Ge Ping speaks out against bodybuilding supplements scam","keywords":"","abstractText":"The hunky MediaCorp actor was recently alleged to have taken pills to achieve his physique","link":[],"images":[{"id":1643786,"author":"","title":"Zheng Ge Ping speaks out against bodybuilding supplements scam","thumbnail":"http:\/\/feeds.wcms.mediacorp.sg\/image\/1643786\/1423324959000\/large16x9\/320\/180\/201502080000-zgp-jpg.jpg","description":"","url":"http:\/\/feeds.wcms.mediacorp.sg\/image\/1643786\/1423324959000\/large16x9\/1600\/900\/201502080000-zgp-jpg.jpg"}],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20150208T091727+0800","published":"20150208T091727+0800"}},{"id":1633486,"body":"<div>\n <p><img alt=\"Zhang Zhen Huan as Gao Guo Tian in 'World at Your Feet'\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1633474\/1422931849000\/201502031050-1zzh-jpg-data.jpg\" \/><br \/><\/p>\n <p>The nominations for this year’s Star Awards online Favourite categories have been released, with an eclectic mix of established veterans and young up-and-comers making the list, and with soccer drama <em>World at Your Feet<\/em> dominating with six mentions across the three categories.<\/p>\n <p>Landing his first online nods is Zhang Zhen Huan, whose role as talented footballer Gao Guo Tian in <em>World at Your Feet <\/em>scored him nominations for Favourite Male Character, as well as Favourite Onscreen Couple with co-star Jeanette Aw. Last year, the Sichuan-born heartthrob was inducted into the Top 10 Most Popular Male Artistes list for the first time.<\/p>\n <p>Zhen Huan, who was celebrating his 31st birthday with friends (and joked about feeling giddy from alcohol) when we reached him for a phone interview last night, called his nominations a breakthrough and, given the good timing of the news coinciding with the special occasion, a form of “double happiness”.<\/p>\n <p>When asked to rate his own chances of walking home triumphant when the victors are announced that evening, Zhen Huan, who made his acting debut in 2008, modestly confessed that he considers himself a newbie. “I really don’t know how high my chances are, but I think it won’t be easy to win.” That said, he’ll still do his part by appealing to fans on social media to vote for him.<\/p>\n <p>His “prediction” applies to his pairing with Jeanette for Favourite Onscreen Couple, although he can see why TV viewers are rooting for the duo. “Our characters went through a lot of ups and downs in their relationship in the show, and that’s probably why audiences can appreciate the chemistry between them,” he mused.<\/p>\n <p><img alt=\"Alousius Pang, Elvin Ng, Romeo Tan, Xu Bin\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1633472\/1422931869000\/201502031050-male-jpg-data.jpg\" \/><br \/><\/p>\n <p>Even if he’s left empty-handed at the end of the day, he hopes that at least one of his fellow nominated 8 Dukes will nab the prizes on behalf of the octet. Aloysius Pang and Xu Bin are also up for Favourite Male Character, Ian Fang has a nod for Favourite Onscreen Couple with Kimberly Chia, and Romeo Tan in the running for both Favourite Male Character and Favourite Onscreen Couple with Rebecca Lim.<\/p>\n <p><strong>Kimberly Chia doesn’t want fans to feel stressed about <\/strong><strong>helping her win<\/strong><\/p>\n <p>Kimberly’s reaction as we read out the names of her fellow Favourite Female Character nominees wasn’t unexpected: “Wow. Wow. (<em>Brief silence<\/em>)” The 19-year-old, who is nominated for her role as Ye Xiao Feng in <em>World at Your Feet<\/em>, is going up against Rui En, Jeanette Aw, Rebecca Lim and Felicia Chin.<\/p>\n <p>“Of course I would like to have hope (but) I think Rui En has a very high chance of winning,” she said. The previous two times Kimberly was up for the same award in 2012 and 2013, it was the two-time Best Actress winner who came out on top.<\/p>\n <p>Nevertheless, Kimberly expressed that she is excited and also relieved to garner the mentions, as <em>World at Your Feet<\/em> is her last Channel 8 drama. “Even though I didn’t have any shows after that, I’m glad the last one I did left an impression!” she said.<\/p>\n <p><img alt=\"Kimberly Chia, Jeanette Aw, Rui En, Rebecca Lim\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1633470\/1422931908000\/201502031050-kimbest-jpg-data.jpg\" \/><br \/><\/p>\n <p>While this marks her third nomination for Favourite Female Character, Kimberly’s entry for Favourite Onscreen Couple with <em>World at Your Feet<\/em> co-star Ian (who texted her with the good news) is her very first. “Our chemistry was good, but we didn’t expect our pairing to receive so much love to the point that fans were suggesting couple names for us!” she chuckled.<\/p>\n <p>Although she has yet to have the chance to accept a trophy on a Star Awards stage, Kimberly remains grateful for the support from her devotees. “I know a lot of my fans voted very hard for me last time, and that alone is a good thing,” she said. “I don’t want them to be disappointed if I don’t win because I’m afraid they will blame themselves – I don’t want them to feel stressed about it!”<\/p>\n <p>But don’t take that as a sign of passiveness from the starlet herself. “I’ll definitely try to get fans to vote for me, maybe together with Ian (for Favourite Onscreen Couple),” she revealed. “I’ll probably ask my friends too, but I won’t be too pushy about it. (<em>laughs<\/em>)”<\/p>\n <p>Also vying for Favourite Onscreen Couple with Zhen Huan &amp; Jeanette and Kimberly &amp; Ian are Li Nan Xing &amp; Rui En in <em>C.L.I.F. 3<\/em>, Romeo Tan &amp; Rebecca Lim in <em>Yes We Can!<\/em>, and real-life married couple (<a href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/joanne-peh-talks-baby-bump-and-weird-cravings\/ar-AA8GeYr\">and parents-to-be<\/a>) Qi Yu Wu &amp; Joanne Peh in <em>C.L.I.F. 3<\/em>.<\/p>\n <p><img alt=\"Qi Yu Wu &amp; Joanne Peh, Zhang Zhen Huan &amp; Jeanette Aw, Kimberly Chia &amp; Ian Fang\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1633468\/1422931891000\/201502031050-couples-jpg-data.jpg\" \/><br \/><\/p>\n <p>With such strong fan bases behind this year’s nominees, we can only foresee a neck and neck race over the next couple of months before the victors are announced at Star Awards 2015 Show 1 on April 19, so remember to keep the votes for your choices coming in!<\/p>\n <p><em>Online voting for Favourite Male Character, Favourite Female Character and Favourite Onscreen Couple (Drama) takes place from February 2<\/em><em>5 at 12am to April 19 at 9pm. For more information on the Star Awards, <a target=\"_blank\" href=\"http:\/\/starawards.com.sg\/\">visit our microsite<\/a>, and stay tuned to xinmsn for more!<\/em><\/p>\n <p><strong>Check out the full nominations list for the Star Awards 2015 Favourites categories below:<\/strong><\/p>\n <p><strong>Favourite Male Character<\/strong><br \/>Aloysius Pang as Fang Yang Min (<em>World at Your Feet<\/em>)<br \/>Elvin Ng as Wu Wei Xiong (<em>World at Your Feet<\/em>)<br \/>Romeo Tan as Zhang Yan (<em>The Journey: Tumultuous Times<\/em>)<br \/>Xu Bin as Guo Jing Cheng\/Cartoon (<em>Against the Tide<\/em>)<br \/>Zhang Zhen Huan as Gao Guo Tian (<em>World at Your Feet<\/em>)<\/p>\n <p><strong>Favourite Female Character<\/strong><br \/>Felicia Chin as Pan Xiao Min (<em>In The Name of Love<\/em>)<br \/>Jeanette Aw as Hong Ming Hui (<em>The Journey: Tumultuous Times<\/em>)<br \/>Kimberly Chia as Ye Xiao Feng (<em>World at Your Feet<\/em>)<br \/>Rebecca Lim as Zhang Xue Qin (<em>Yes We Can<\/em>)<br \/>Rui En as Qiu Xue Qing (<em>Against the Tide<\/em>)<\/p>\n <p><strong>Favourite Onscreen Couple (Drama)<\/strong><br \/>Ian Fang &amp; Kimberly Chia as Hong Dehai &amp; Ye Xiaofeng (<em>World at Your Feet<\/em>)<br \/>Li Nan Xing &amp; Rui En as Wei Lan Tian &amp; Huang Zhi Jie (<em>C.L.I.F. 3<\/em>)<br \/>Qi Yu Wu &amp; Joanne Peh as Tang Yao Jia &amp; Liao Xin Yi (<em>C.L.I.F. 3<\/em>)<br \/>Romeo Tan &amp; Rebecca Lim as Liu Jun Wei &amp; Zhang Xue Qin (<em>Yes We Can<\/em>)<br \/>Zhang Zhen Huan &amp; Jeanette Aw as Gao Guo Tian &amp; Mo Yu Qing (<em>World at Your Feet<\/em>)<\/p>\n <p><strong>Catch Star Awards 2015 - Prelude every Friday from April 3 to 24, 10.30pm on Channel 8<\/strong><br class=\"k-br\" \/><\/p>\n <p><strong>Catch Star Awards 2015 Show 1 Awards Ceremony on April 19 (Sun), 7pm, LIVE on Channel 8<\/strong><br class=\"k-br\" \/><\/p>\n <p><strong>Catch Star Awards 2015 Show 2 Walk of Fame on April 26 (Sun), 5pm, LIVE on Channel 8<\/strong><br class=\"k-br\" \/><\/p>\n <p><strong>Catch Star Awards 2015 Show 2 Awards Ceremony on April 26 (Sun), 7pm, LIVE on Channel 8<\/strong><br class=\"k-br\" \/><\/p>\n <p><strong>Catch Star Awards 2015 Show 2 Post Show Party on April 26 (Sun), 10.30pm, LIVE on Channel 8<\/strong><\/p>\n<\/div>","author":"Tammi Tan","title":"SA2015: Zhang Zhen Huan scores his first nods in Favourite categories","keywords":"","abstractText":"The nominations for Favourite Male Character, Favourite Female Character and Favourite Onscreen Couple have just been released","link":[],"images":[{"id":1633474,"author":"","title":"Zhang Zhen Huan as Gao Guo Tian in 'World at Your Feet'","thumbnail":"http:\/\/feeds.wcms.mediacorp.sg\/image\/1633474\/1422931849000\/large16x9\/320\/180\/201502031050-1zzh-jpg.jpg","description":"","url":"http:\/\/feeds.wcms.mediacorp.sg\/image\/1633474\/1422931849000\/large16x9\/1600\/900\/201502031050-1zzh-jpg.jpg"}],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20150205T100738+0800","published":"20150203T150000+0800"}},{"id":1530172,"body":"<div>\n <p><img alt=\"Jin Yin Ji, Allen Chen, Julie Tan and Carrie Wong at Julie's 22nd birthday party in September\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1530160\/1418635601000\/julie-tan-1-data.jpg\" \/><br \/>As colleagues working in the same compound, it’s the norm to spot artistes queueing up for food at the canteen or hanging around the campus on a regular basis. So what are the chances of bumping into MediaCorp actress Julie Tan and Taiwanese model-turned-actor Allen Chen together twice in a month?<br \/>Last month, a xinmsn reporter happened to be onboard the same flight as Allen, only to spot Julie waiting for a “friend” at Changi Airport at the arrival gates. One week later, the same reporter ran into the pair – again – but at the cinemas this time.<br \/>Something’s brewing for sure, we thought, and we tried to reach both parties for a confirmation afterwards. However, Allen was not available for an interview due to a busy filming schedule, according to his management agency, Catwalk Asia, whereas Julie declined to comment on the topic.<br \/>As fate would have it, last Friday (Dec 12), Julie showed up for an imaging session for Ch8’s blockbuster series <em>The Journey: Our Homeland<\/em> along with her co-stars Jeffrey Xu and Romeo Tan.<br \/><img alt=\"Jeffrey Xu, Julie Tan and Romeo Tan.\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1530168\/1418635816000\/julie-tan-3-data.jpg\" \/><br \/>When asked to clarify her relationship status with Allen, the 22-year-old maintained a “we are just friends” stance, emphasising that it is normal for a girl to go out with a male friend. “I went for movies with Xavier Ong and we appeared in the papers because of that! I hang out with Shane Pow alone too, sometimes,” Julie shared.<br \/>As someone who appreciates one-on-one time with her friends, the actress believes that such outings are when two people can truly connect and learn more about each other.<br \/>As an up-and-rising starlet, is she not concerned about getting recognised on the streets?<br \/>“Well, we were spotted by you! I’m okay about it as we are just friends hanging out together. I wouldn’t stop meeting people just because I have added identity as an actress,” Julie reiterated. “When you saw us the other day, we were dressed normally too. We didn’t specially disguise ourselves.”<br \/>According to the actress, Julie first met Allen when she visited Xu Bin on a filming set, adding that they occasionally hung out as a group. Apparently, Allen has also interacted with Julie’s mum during her 22nd birthday party in September.<br \/><img alt=\"Julie Tan tried a 70s 'do at the imaging session of The Journey: Our Homeland.\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1530164\/1418635782000\/julie-tan-2-data.jpg\" \/><br \/><strong>Julie: The world is full of possibilities<\/strong><br \/>“The concept of dating in the West is that you meet up with people for meals and movies to get to know more about the other party. To me, the world is full of possibilities and anything is possible,” Julie pointed out.<br \/>“There are no absolutes when it comes to matters of the heart. I would let nature run its course. Whether love comes my way or not, so be it. I wouldn’t rule out any possibility or force things to happen.”<br \/>Four months after parting ways with her ex-boyfriend, the starlet now hopes to explore her options without setting any restrictions. In fact, Julie was so deeply affected by the failed relationship that she wallowed in unhappiness for a month before she moved on, thanks to encouragement from her family and friends.<br \/>“I wasted too much time on a single person [in the past]. My life basically revolved around him. I’m 22 now and I will turn 30 in eight years. If I don’t work hard for my career now, I would regret it in the future!” she exclaimed.<br \/>During the interview, we couldn’t help noticing Julie’s compliments about Allen – “He has a very good personality. He’s a nice guy!”<br \/>Nevertheless, the chirpy actress refused to make comparisons between her ex-beau and Allen. “There’s nothing between us yet, so I don’t want to frighten anyone away,” Julie asserted, while giving her word that she would announce it if she does get attached.<br \/><strong>Learning independence at 22<\/strong><br \/>Unbeknownst to many, Julie moved out of her family house to live on her own two months ago.<br \/>“My mum said that it was time for me to be independent. I spent quite some time looking for a unit,” she revealed. “I’m now residing in a one-room apartment. I have a good friend who shuttles between Taiwan and Singapore. She would stay with me when she’s in town.”<br \/>While sharing about her newfound autonomy, Julie recalled how her mother was so impressed about her washing the dishes, when the latter came over for a visit. For someone who is capable of cooking herself a nice meal, the actress has no problems living alone for now.<br \/>After wrapping filming for Ch8’s upcoming drama <em>Tiger Mummy<\/em>, Julie will begin work for <em>The Journey: Our Homeland <\/em>where she plays a tomboyish character named Yao Jia Hui.<br \/>Earlier this year, the ambitious thespian participated in a movie called <em>Mystery<\/em> that has recently opened in Chinese cinemas. If things fall into place, Julie will be heading to Beijing again for new projects next year.<br \/><em>This interview is translated by Dang Hui Ling.<\/em><br \/><strong><em>The Journey: Our Homeland debuts 6 July 2015 on weekdays at 9pm on Channel 8.<\/em><\/strong><\/p>\n<\/div>","author":"Louis Teo","title":"Romance is blossoming between Julie Tan and Allen Chen? ","keywords":"Julie Tan","abstractText":"The MediaCorp actress does not want to rule out any possibilities","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141215T173520+0800","published":"20141215T173520+0800"}},{"id":1503822,"body":"<div>\n <p><img alt=\"Chen Tian Wen’s wife is three months pregnant\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1503820\/1417417948000\/201412011512-1-jpg-data.jpg\" \/><br \/><\/p>\n <p>Six months after tying the knot in a lavish, star-studded ceremony, Chen Tian Wen has revealed that he’s going to be a father for the first time – his wife Bao Xiao Hui is currently three months pregnant.<\/p>\n <p>The MediaCorp artiste, who is currently filming ongoing long-form drama <em>118<\/em>, revealed to xinmsn in a phone interview today that they found out the good news last month. The baby’s due date is in mid-June next year.<\/p>\n <p>Although the couple is clearly overjoyed, Tian Wen admitted that they are also at a slight loss of what to do due to the unexpected – but welcome – turn of events. They have been trying for a little one but were still caught by surprise when they successfully conceived.<\/p>\n <p>“We feel an extra sense of responsibility and that we have a lot of things to reconsider,” said the veteran actor, who was nominated for Best Supporting Actor at last year’s Golden Horse Awards for his role in <em>Ilo Ilo<\/em>. He added that he will not be giving up his showbiz career as he still needs to earn money to provide for his growing family.<\/p>\n <p>When asked if they are hoping for a girl or a boy, Tian Wen let on that he hopes to keep the gender a surprise (even for himself) until the day their bundle of joy is delivered. His wife, on the other hand, wants a girl because she feels that a daughter will be more filial.<\/p>\n <p><img alt=\"Chen Tian Wen’s wife is three months pregnant\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1503818\/1417417948000\/201412011512-2-jpg-data.jpg\" \/><br \/><\/p>\n <p>Unfortunately, Xiao Hui does not seem to be coping well with the physical predicaments of pregnancy. The mother-to-be, who is 21 years Tian Wen’s junior, has been experiencing severe bouts of morning sickness, and easily throws up whatever she has just eaten.<\/p>\n <p>One major change Tian Wen made in his life as soon as he discovered his new daddy-to-be status was to kick his 30-year drinking habit, as the 51-year-old wants to be in tip-top condition to care for his child. As a result, his weight dropped from 83kg to 77kg in just over a month.<\/p>\n <p>He has also cut back on after-work social activities with his <em>118<\/em> co-stars, who usually go out for meals after a day of filming. Before choosing to reveal his wife’s pregnancy, he would excuse himself by saying she was feeling unwell at home.<\/p>\n <p>While preparations for the new arrival are yet to be underway, they have plans to convert the guestroom into a baby room, and are already looking for a confinement nanny. Tian Wen also said that the crib will likely come from his family’s furniture company.<\/p>\n <p>Now that baby number one is already on its way, can we expect to hear news of number two a few years down the road?<\/p>\n <p>Well, that depends on which parent gets their way: mama feels that one will be enough, and papa thinks two would be ideal. “An only child would be too lonely!”<\/p>\n <p><em>Catch Tian Wen in 118 every weeknight at 7.30pm on Channel 8.<\/em><\/p>\n<\/div>","author":"Tammi Tan","title":"Chen Tian Wen’s wife is three months pregnant","keywords":"","abstractText":"The actor found out that that he was going to be a father last month","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141201T151426+0800","published":"20141201T151426+0800"}},{"id":1499058,"body":"<div>\n <p><img alt=\"Elvin Ng\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1499052\/1417163577000\/elvin-ng-1-data.jpg\" \/><br \/>Earlier this week, xinmsn visited the set of ChU’s upcoming drama <em>Let It Go<\/em> at Bishan Park, where Elvin Ng, Mindee Ong, Macy Chen (Meixin) and Alaric Tay were seen filming under the scorching sun.<br \/>Produced by WaWa Pictures and co-written by local actress Jesseca Liu, the 13-episode drama’s other cast members include Jeanette Aw and Cavin Soh.<br \/><em>Let It Go<\/em> tells the story of a popular blogger Yan Neo (Jeanette) who rose to fame after sharing her break-up stories and recovery process from 10 past failed relationships on her website.<br \/>To prove that her good friend Jia Yi’s (Mindee) boyfriend is a philanderer, Yan Neo specially hired photographer Mark Chow (Elvin) to unveil the truth. However, Mark turned out to be an extremely conservative man with strong moral values and hence, he refused to intrude into other people’s privacy.<br \/>Although Mark and Yan Neo were at loggerheads in the beginning due to conflicting opinions, they started seeing a different side of each other after experiencing several incidents together.<br \/><img alt=\"Elvin Ng and Mindee Ong\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1499054\/1417163612000\/elvin-ng-2-data.jpg\" \/><br \/>Unlike his rational personality in the show, Elvin is, in fact, an emotional person who is exceptionally devoted when it comes to romance. A self-proclaimed romanticist, the 33-year-old reiterated that relationships are very important to him. “I can give up ‘bread’ (referring to his career) for love,” he said.<br \/>During the interview, Elvin also shared that his first relationship lasted for over five years. While it hurt to break up with his ex, he is willing to suffer the pain that results from love.<br \/>“When a person entirely invests his feelings [into a relationship], he will become vulnerable and getting hurt is inevitable. But when you put in true feelings, there will be memories worth cherishing,” explained the actor.<br \/>In Elvin’s opinion, the fastest way to get over a break-up is to “quickly jump into a new relationship”. Yet, as he grows older, he gradually realised that this method is not as feasible as before. “You need to give yourself time and space to collect your thoughts before moving on,” he added.<br \/>While the Chinese title of <em>Let It Go<\/em> literally translates to “Happy Break-up”, the heartthrob believes that it is impossible to be happy after going separate ways with a lover. “The emotional reliance between two people cannot be demolished so easily. Starting all over again is a very draining thing,” Elvin thought aloud.<br \/>As his sentiments seem to contradict the show’s theme, the actor jokingly teased his <em>Who Killed the Lead<\/em> co-star Jesseca for her “lousy script”. On the other hand, however, Elvin claimed to have learned how to “rediscover oneself” after an unsuccessful relationship, thanks to the drama.&nbsp;<br \/><em>This interview is translated by Dang Hui Ling.<\/em><br \/><em>Let It Go premieres Feb 23, every Monday to Friday at 10pm on ChU.<\/em><br \/><strong><a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/video\/watch\/video\/what-tips-does-elvin-ng-have-when-you-re-out-of-love-%E9%BB%84%E4%BF%8A%E9%9B%84%E8%A7%89%E5%BE%97%E5%A4%B1%E6%81%8B%E6%9C%80%E5%A5%BD%E7%9A%84%E7%96%97%E4%BC%A4%E6%98%AF%E4%BB%80%E4%B9%88\/vi-04dda91b-ff71-14be-9bf9-afc17c1c8e23\">WATCH: Elvin Ng dishes tips on getting over a relationship<\/a><\/strong><\/p>\n<\/div>","author":"Wu Qi","title":"It’s love over money for Elvin Ng ","keywords":"Elvin Ng","abstractText":"The self-professed romanticist shared some tips on mending a broken heart","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141128T163611+0800","published":"20141128T163611+0800"}},{"id":1486062,"body":"<div>\n <p><strong><img alt=\"Felicia Chin\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1486048\/1416562424000\/felicia-chin-1-data.jpg\" \/><br \/>Photos: Wu Qi<br \/>Video: Foong Mien Shi and Lye Yuk Sing&nbsp;<\/strong><br \/>In her first project after rejoining MediaCorp in March, local actress Felicia Chin took on her maiden period drama role as Zhang Min in Ch8 blockbuster series <em>The Journey: Tumultuous Times<\/em>. While speaking to xinmsn at the press conference on Wednesday, the 30-year-old let on about her numerous emotionally intense scenes in the drama.<br \/>Caught in a love triangle with Hong Dang Yong (Andie Chen) and Zhang Yan (Romeo Tan), Zhang Min is a passionate school teacher who leads her students in protests against colonial rule.<br \/>Initially, Felicia was worried about acting as Hong Dang Yong's childhood sweetheart in her and Andie's first film collaboration. To her surprise, Andie took initiative to text her and discuss their roles before filming commenced, which left a good impression on the actress.<br \/>The relationship between Felicia and Romeo’s characters is at the other end of the spectrum. Crazed by his “love” and possessiveness, Zhang Yan locked his non-blood related cousin Zhang Min in an abandoned building, where he sexually assaulted her.<br \/>“Everyone was very serious, but there were also some comedic moments,” Felicia recalled. “I was completely enveloped with emotions, but when Romeo leaned in to forcibly kiss me, I burst out laughing!”<br \/>And the reason for that is because of Romeo’s facial hair. “When he is tired, his moustache grows very fast. We filmed that scene in the afternoon and his moustache had grown out by then, so it felt very ticklish!” she chuckled.<br \/>Although Felicia claimed to have good chemistry with Romeo, the actress was “awakened by his kiss” and could not stop laughing even after several takes. In the end, Romeo had to shave on the spot before filming continued.<br \/>However, the giggly actress insisted that there was no awkwardness as she is very close to Romeo in real life. “It makes filming easier when we are familiar with each other. Actually, I am glad that Romeo is my co-star because we communicate well,” she added.<br \/><img alt=\"Andie Chen, Felicia Chin and Romeo Tan in The Journey: Tumultuous Times. (Photo: Channel 8)\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1486054\/1416562496000\/felicia-chin-2-data.jpg\" \/><br \/>But Felicia chose to keep details about the rape scene from her mother. “I like to give my mum surprises. (<em>laugh<\/em>) I don’t want her to think too much, so I’d usually tell her after filming wrapped,” she explained.<br \/>When we brought up Joanne Peh’s rape scene in <em>The Little Nyonya<\/em> which won her the “Best Actress” trophy at the Star Awards 2009, Felicia said that the most important thing is for viewers to support <em>The Journey: Tumultuous Times<\/em>.<br \/>“This is my comeback project and I think all the actors did a great job. I haven’t really thought about it (Star Awards), but it would definitely be a huge encouragement if I do get nominated,” the actress humbly replied.<br \/>Three months of filming in Ipoh certainly forged a strong bond between the cast of <em>The Journey: Tumultuous Times<\/em>. In a group chat among the actors, <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/andie-chen-baby-aden-is-my-beacon-of-hope\/ar-BBeLKWl\">Andie often shared photos and videos of his four-month-old son Aden<\/a>, which seemed to have triggered Felicia’s motherly instinct.<br \/>“I’ve always wanted to have a baby! When I see Andie and my friends who became parents at a young age and have a lot of energy to look after their kids, I’m a little envious, to be honest,” she confessed.<br \/>Nevertheless, being surrounded by friends who are married with children also meant that Felicia has “many babies to play with”, which has satisfied the busy actress for now.&nbsp;<br \/><em>This interview is translated by Dang Hui Ling.<\/em><br \/><strong><a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/video\/watch\/video\/why-did-felicia-chin-giggled-while-filming-a-rape-scene-%E9%99%88%E5%87%A4%E7%8E%B2%E6%8B%8D%E5%BC%BA%E6%9A%B4%E6%88%8F%E6%97%B6%E4%B8%BA%E4%BB%80%E4%B9%88%E4%BC%9A%E7%AC%91%E5%9C%BA\/vi-766b1afb-1411-f473-708f-c3b86637aa53\">WATCH: Felicia Chin shares about her “comical” rape scene with Romeo Tan<\/a><\/strong><br \/><strong><em>The Journey: Tumultuous Times premieres November 24 at 9pm on Ch8.<br \/><img alt=\"Felicia Chin\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1486058\/1416562527000\/felicia-chin-3-data.jpg\" \/><\/em><\/strong><br \/><\/p>\n<\/div>","author":"","title":"Felicia Chin is tickled by Romeo Tan’s moustache ","keywords":"","abstractText":"The local actress takes on her first period drama in The Journey: Tumultuous Times","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141121T174305+0800","published":"20141121T174305+0800"}},{"id":1485150,"body":"<div>\n <p><strong><img alt=\"Desmond Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1485140\/1416533497000\/desmond-tan-1-data.jpg\" \/><br \/>Photos: Wu Qi<br \/>Video: Foong Mien Shi and Vina Chia<\/strong><br \/>The first thing we noticed before our interview with MediaCorp actor Desmond Tan at the press conference of Ch8’s blockbuster series <em>The Journey: Tumultuous Times<\/em> on Wednesday was his moppy hair and moustache. &nbsp;<br \/>“I couldn’t regain my youth after acting in <em>Tumultuous Times<\/em>,” he chuckled.<br \/>In the second installment of the trilogy, Desmond resumes his role as Hong Shi, who becomes a father and a grandfather. Although he has fewer scenes this tiem around, Hong Shi will make appearances throughout the 30-episode drama.<br \/>According to Desmond, the challenge is in “acting old” because it is something that he has not tried before. With Jeanette Aw and <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/andie-chen-baby-aden-is-my-beacon-of-hope\/ar-BBeLKWl\">Andie Chen<\/a> acting as his children, the 28-year-old was “insecure and worried” that his portrayal would not be realistic. However, filming turned out to be less awkward than he imagined, and so he believes that the result will be acceptable.<br \/>When asked about his current image, Desmond explained that it is for a new role in ChU’s upcoming show <em>Second Chance <\/em>(slated to broadcast early next year), where he plays a hooligan lawyer. Busy with filming since October, the actor has been working hard to capture both the essence of a lawyer and a hooligan.<br \/>Although Desmond was told that he can finally return to a clean shaven look at the end of the year, he is starting to feel a little reluctant. “I never thought that I would fall in love with my moustache. I grew comfortable with it after some time,” he let on, while sharing that he specially bought some tools to maintain the facial hair with ease.<br \/><img alt=\"Photo: Channel 8\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1485142\/1416533551000\/desmond-tan-2-data.jpg\" \/><br \/><strong>Asian Television Awards nomination is proof of his comedic talent&nbsp;<\/strong><br \/>The <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/pierre-png-jeffrey-xu-bag-double-nominations-at-asian-television-awards\/ar-BBdsIq2\">Asian Television Awards nominations list<\/a> that was announced last week saw Desmond earning a nod in the Best Comedy Performance by an Actor\/Actress category for his role as Kai in Ch5’s <em>Spouse For House<\/em>.<br \/>“I was quite surprised when I learned about it, since that was my first comedic role in the past seven years [of my showbiz career],” he admitted. “I’m glad to be nominated alongside the veterans (including Richard Low, Irene Ang, Quan Yifong and Guo Liang) and I’ll be happier if I manage to bring the trophy home!”<br \/>The actor, however, has not given much thought on his chances of winning the prize. Should his schedule allows it, he would love to experience the awards ceremony.<br \/>Desmond also revealed that&nbsp;<em>Spouse For House <\/em>will be returning with a second season next year, something which he is looking forward to. “Acting in comedies is very fun and it keeps me in a good mood during and after filming,” he said. “When I film emotional dramas, I feel heavy-hearted even after I get home.”<br \/>In fact, there were days when the actor went home with a headache after filming <em>Tumultuous Times<\/em>, as 80 percent of his scenes involved scolding Andie’s character.<br \/>So, has Desmond’s sense of humour improved after his comedic debut?<br \/>“Actually, I’ve always believed that I am a humorous person but nobody agrees! Now, I have proven everyone wrong [with the nomination]!” he laughed.<br \/>Apart from comedy, Desmond has no qualms taking up sissy characters or roles that require him to “uglify” himself, even though producers have advised him to “maintain his image”.<br \/><img alt=\"Desmond Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1485144\/1416533573000\/desmond-tan-3-data.jpg\" \/><br \/><strong>Desmond in talks to make movie debut next year<\/strong><br \/>During the interview, Desmond divulged his plans for the upcoming year – Ch5 viewers can expect to see him in the new season of <em>Mata Mata<\/em> in 2015.<br \/>And if things fall into place, the “8 Dukes” member is likely to make his big screen debut next year. Desmond may not be able to share more details about the project as discussions are still underway, but he is certainly pumped about it.<br \/>Despite his overloading schedule, the actor hopes to make time for an overseas vacation with his family. “I really enjoy going on holidays with my family and I encourage everyone to do that too. Even a short trip feels really good!” he said.<br \/>Although it seems like he will be spending Christmas with work, Desmond is keeping fingers crossed that he will be able to uphold the tradition of hosting a party at his house to celebrate the occasion with his buddies. &nbsp;<br \/><strong><em>The Journey: Tumultuous Times premieres November 24 at 9pm on Ch8.<\/em><br \/><a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/video\/watch\/desmond-tan-once-an-old-man-always-an-old-man-陈泂江演了一次老人就-年轻-不回来\/vi-bbdfd784-12b9-7127-4926-589c96e9e20d\">WATCH:&nbsp;Desmond Tan talks about his love for his new look and comedies&nbsp;<\/a><\/strong><\/p>\n<\/div>","author":"Dang Hui Ling","title":"Desmond Tan is in love with his facial hair  ","keywords":"Desmond Tan Tumultuous Times ","abstractText":"The MediaCorp actor is currently sporting the rugged look for a new role ","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141121T093902+0800","published":"20141121T093902+0800"}},{"id":1470780,"body":"<div>\n <p><img alt=\"Pierre Png, Jeffrey Xu bag double nominations at Asian Television Awards\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1470788\/1415872125000\/201411131748-1-jpg-data.jpg\" \/><br \/><\/p>\n <p>The nominations for this year’s Asian Television Awards have been announced, and a number of our very own local thespians have done us proud by bagging mentions in the acting categories.<\/p>\n <p>The Best Actor in a Supporting Role category in particular is dominated by Singapore talent, with five out of the six individual hopefuls representing local productions: Zhu Hou Ren (for Channel U’s <em>Served H.O.T<\/em>), Rayson Tan (for Channel 8’s <em>Entangled<\/em>), Alaric Tay and Michael Dorman (both for HBO’s <em>Serangoon Road<\/em>), and Jeffrey Xu.<\/p>\n <p>Yes, the same Jeffrey Xu who took home the same award last year for his role in Channel U’s <em>Marry Me<\/em>. This time though, he’s received a double dose of good fortune, scoring not one but <em>two <\/em>nods in the category – for Channel 8’s <em>Gonna Make It<\/em> and Channel U’s <em>Scrum!<\/em>.<\/p>\n <p>Interestingly enough, his characters in the two dramas are polar opposites: he is an effeminate hairstylist with a penchant for flowery clothes in <em>Gonna Make It<\/em>, and a beefed up rugby captain in <em>Scrum!<\/em>.<\/p>\n <p>“When I first heard about being nominated last year, I thought, ‘Oh, okay, that’s great’ but I never expected to win,” the actor told xinmsn in a phone interview from Japan, where he is currently filming <em>Find the Wasabi<\/em>. “And this time, I’m like, ‘<em>Two <\/em>nominations!? It’s not possible!’ I was shocked!”<\/p>\n <p>When asked which show he hopes will win him the award, Jeffrey picked <em>Gonna Make It.<\/em> “I didn’t feel a lot of pressure portraying this character, but even so, I still managed to deliver, which I found quite strange,” he said. “I would like to thank all the people that I observed to get into character!”<\/p>\n <p>Saying that he probably clinched the award last year because of his natural acting in <em>Marry Me<\/em>, Jeffrey said that this time around, he hopes the judges will be impressed with him showing different sides of him in both dramas.<\/p>\n <p>Now that he’s one step closer to conquering the regional scene again, does he still long for a Star Awards trophy? “Of course I do!” he admitted. However, it’s not for a reason most people might think. “It’s just touching to have all your hard work acknowledged, and although I know some may think my acting isn’t very good, I still hope for them to recognise my skills.”<\/p>\n <p>Another double contender, this time for Best Actor in a Leading Role, is Pierre Png, whose roles in Channel 8’s <em>The Journey: A Voyage<\/em> and Channel 5’s <em>Zero Calling<\/em> are both recognised. He was Highly Commended in last year’s Best Actor in a Supporting Role category for <em>C.L.I.F. 2<\/em>, but ultimately lost to Jeffrey.<\/p>\n <p>Pierre was at an audible loss for words when we spoke to him on the phone after he’d heard the good news. “To be nominated twice in the same category is something quite unheard of as far as I’m concerned! Maybe I think too lowly of myself,” he chuckled.<\/p>\n <p>But the real shocker, he said, was being nominated again for the role of the villainous Heilong in <em>The Journey: A Voyage<\/em>, which won him Best Actor at this year’s Star Awards. “[If I win], hopefully this time I’ll come up with a better thank you speech!”<\/p>\n <p>And since he has already triumphed in an acting category for <em>The Journey: A Voyage<\/em>, he hopes that this time, it will be <em>Zero Calling<\/em> that gets him up on stage – or at least, that was the “easiest answer” he gave when we asked. “Heilong already won for Channel 8, and now it’s time to win for Channel 5,” he said, confessing his shock for the umpteenth time.<\/p>\n <p>Taking his nominations – and previous wins – as an affirmation of his hard work and perseverance (“You know how proficient I am in Chinese right,” quipped Pierre, who’s more comfortable with speaking in English), he said a win would a “stamp of approval”, and a loss would just be another form of motivation to work harder (although, he joked that it would be difficult to go back after not even winning one of his two nominations).<\/p>\n <p><img alt=\"Pierre Png, Jeffrey Xu bag double nominations at Asian Television Awards\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1470790\/1415872126000\/201411131748-2-jpg-data.jpg\" \/><br \/><\/p>\n <p>The ladies are certainly not left out of the honour – Rebecca Lim, Xiang Yun, Priscelia Chan and Sora Ma all scored nominations for Best Actress in a Supporting Role. Xiang Yun is being recognised for <em>The Caregivers<\/em>, Sora is nominated for <em>C.L.I.F. <\/em>3, SA2014 Rocket Award recipient Priscelia has her vicious part in <em>The Journey: A Voyage<\/em> to thank for her mention, and Rebecca’s SA2014 Best Supporting Actress-winning role in <em>The Dream Maker<\/em> impresses once again.<\/p>\n <p>“I’m feeling awesome and I’m happy for Rebecca as well, but awards are elusive and I’m just grateful to be nominated,” shared Priscelia via a text message.<\/p>\n <p>The Red Dot pride doesn’t end there: it’s an onscreen family affair for the stars of Channel 5’s <em>Spouse For House<\/em> Desmond Tan, Richard Low, Selena Li and Irene Ag, who all garnered nods in the Best Comedy Performance by an Actor\/Actress category. Quan Yi Fong and Guo Liang are also nominated for Channel 8’s <em>Black Rose II<\/em>.<\/p>\n <p>“I’m surprised to hear this because this is my first comedic role, but at the same time I’m honoured to be nominated alongside such good and experienced comedians,” Desmond shared via text message.<\/p>\n <p>Fans of Rui En will be happy to hear that she has been nominated alongside the likes of Hong Kong’s Kristal Tin and Taiwan’s Tien Hsin for Best Actress in a Leading Role, for Channel 8’s <em>Sudden<\/em>. She previously took home the trophy in 2012 for <em>Unriddle 2<\/em>.<\/p>\n <p>Channel 5’s <em>Spouse for House <\/em>and <em>The Noose<\/em> garnered mentions for Best Comedy Program, and xinmsn’s very own web series <em>Who Killed the Lead<\/em> is nominated for Best Digital Fiction &amp; Non-Fiction Programme\/Series.<\/p>\n <p><strong>For the full list of nominations, please visit this <a href=\"http:\/\/ata.onscreenasia.com\/ata2014\/nomination-list.asp\">link<\/a>.<\/strong><\/p>\n<\/div>","author":"Tammi Tan","title":"Pierre Png, Jeffrey Xu bag double nominations at Asian Television Awards","keywords":"","abstractText":"Many Singapore talents have done us proud by nabbing mentions at the prestigious awards ceremony","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141113T175320+0800","published":"20141113T175320+0800"}},{"id":1469842,"body":"<div>\n <p class=\"candarara-ah-ah-ah\"><img alt=\"Joanne Peh’s wedding banquet “could happen really quickly”\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1469840\/1415845305000\/201411131021-jo1-jpg-data.jpg\" \/><br \/><\/p>\n <p class=\"candarara-ah-ah-ah\"><strong>Photos: Tammi Tan<\/strong><br \/><\/p>\n <p class=\"candarara-ah-ah-ah\">Joanne Peh seemed to be in a jovial mood during our chat between takes at yesterday’s shoot for Channel 5’s <em>Code of Law<\/em> season 3, in which she reprises her role of lawyer Sabrina Wong.<br \/><\/p>\n <p class=\"candarara-ah-ah-ah\">However, the actress, <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/qi-yuwu-and-joanne-peh-are-married\/ar-BB4GISV\">who secretly wed Qi Yuwu in September<\/a>, <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/joanne-peh-joins-qi-yuwu-to-headline-1965\/ar-BB88bCG\">turned just as cryptic as before<\/a> when the topic of conversation switched from the series to her recent nuptials and new role as a wife. “[It’s] great!” was all she would offer.<\/p>\n <p class=\"candarara-ah-ah-ah\"><\/p>\n <p class=\"candarara-ah-ah-ah\">Then, when prompted for updates on her wedding banquet, she inquired with a surprised expression, “Is everyone expecting one?” (“Yes.”) “Really?” (“Yes!”) [<em>Ed note: the post-wedding press release from Artiste Management Division stated that it will take place next year.<\/em>]<\/p>\n <p class=\"candarara-ah-ah-ah\">Saying that she and Yuwu are “the kind of people that don’t plan too far ahead” because of their eventful and erratic work schedules, she’s leaving the formal celebration as something that “will happen when it happens”. “It’s just that we haven’t really sat down and talked about it yet.”<\/p>\n <p class=\"candarara-ah-ah-ah\">“Interestingly,” she added. “[This also means that] if we <em>do<\/em> decide to do something, it could happen really quickly. Maybe tonight we’ll have a discussion and it might happen next month, for all you know! Maybe it’ll be another surprise – and don’t you love surprises? (<em>sly smile<\/em>)” (Well, after that bridal bombshell, we don’t doubt that Mr. and Mrs. Qi would be capable of more of those.)<\/p>\n <p class=\"candarara-ah-ah-ah\">But the likelihood of the couple putting together a lavish wedding dinner by the end of the year, even a small one, seems low. Soon, the cast and crew of upcoming movie <em>1965 <\/em>(which Joanne and Yuwu are both involved in) will be heading off to Batam for rehearsals and principal photography.<\/p>\n <p class=\"candarara-ah-ah-ah\">One thing’s for sure, though: Joanne loves children and wants to have them. “I don’t think I’ll ever be bored with children, or upset when they’re around.” She wants four kids but, “At this point in time, we’ll let fate happen and see where we go.”<\/p>\n <p class=\"candarara-ah-ah-ah\"><img alt=\"Joanne Peh’s wedding banquet “could happen really quickly”\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1469838\/1415845305000\/201411131021-jo2-jpg-data.jpg\" \/><br \/><\/p>\n <p class=\"candarara-ah-ah-ah\"><strong>WATCH: <\/strong><a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/video\/watch\/when-is-joanne-peh-throwing-her-wedding-banquet\/vi-3b5d2c15-d2ff-9bf7-3d86-bd15ea4001b5\">Joanne and Yuwu enjoy each other’s company as much as they can<\/a><\/p>\n<\/div>","author":"Tammi Tan","title":"Joanne Peh’s wedding banquet “could happen really quickly”","keywords":"","abstractText":"The newlywed actress has yet to talk about the celebrations with husband Qi Yuwu","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141113T102339+0800","published":"20141113T102339+0800"}},{"id":1466348,"body":"<div>\n <p><img alt=\"Channel 5 revamp goes for a heavier dose of local flavour\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1466340\/1415694733000\/201411111631-enly-jpg-data.jpg\" \/><br \/><em>Chua Enlai and Yasminne Cheng, the hosts of the upcoming 'The 5 Show'.<\/em><\/p>\n <p>With the New Year will come a revamped Channel 5. Starting 1 January 2015, the MediaCorp English channel will roll out a string of brand new shows that are more relevant to viewers in Singapore.<\/p>\n <p>“We know for a fact that our local content generally rates higher and sells better, and that is why we are going with this local upsize strategy,” said Bernard Lim, Managing Director of MediaCorp TV, at the announcement of the refurbishment this afternoon. “At present, the local content on Channel 5’s primetime slot consists of about 30%, but come July 2015, we hope to increase that to 60%.”<\/p>\n <p>The overhaul kicks off with <em>The 5 Show<\/em>, a live info-tainment program, that addresses current affairs, topics and issues that local viewers can relate to in a more light-hearted and interactive way, as opposed to how they would be reported on by the proper news channels. Celebrities who are in town or making waves at the moment may also be invited for an interview on the show.<\/p>\n <p><img alt=\"Channel 5 revamp goes for a heavier dose of local flavour\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1466344\/1415694736000\/201411111631-bern-jpg-data.jpg\" \/><br \/><em>Managing Director of MediaCorp TV, Bernard Lim.<\/em><\/p>\n <p>“What we want to do is reflect on the news we’ve heard in the previous days and discuss these things,” explained Chua Enlai, who will be hosting <em>The 5 Show<\/em> with Class 95FM deejay Yasminne Cheng. “The news reports the news, then people talk about it – it’s like we are bringing their debates to a live show on air.”<\/p>\n <p>That said, it will not be in the same vein as Jimmy Fallon’s <em>The Tonight Show<\/em> or <em>The Ellen Degeneres Show<\/em>, which fall into the comedy category, and it certainly won’t be anything like satirical hit <em>The Noose<\/em>, also featuring Enlai, which is set to make a return on 24 June 2015. “We want to keep it entertaining and a bit funny, but at the end of the day, it should be conversational.”<\/p>\n <p>At the event, it was also revealed that Enlai has signed on as a MediaCorp artiste while continuing to be managed by FLY Entertainment, effective today. Both Enlai and Bernard did not comment further on the specifics of the contract.<\/p>\n <p>“[Taking on <em>The 5 Show<\/em>] was just one of the catalysts,” said Enlai when we asked about his reasons for joining. “But I’ve been working [with MediaCorp] on a lot of shows already so it just made sense to kick off this partnership, and honestly, I’m going to be in the office everyday anyway, you know!”<\/p>\n <p><img alt=\"Channel 5 revamp goes for a heavier dose of local flavour\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1466346\/1415694725000\/201411111631-noose-jpg-data.jpg\" \/><br \/><em>Jojo Joget (Suhaimi Yusof) and Andre Chichak (Alaric Tay) can't believe that &quot;Jacques Ooi&quot; (Enlai's character on The Noose) is &quot;moonlighting&quot; on another Channel 5 show.<\/em><\/p>\n <p>Also coming up is reality TV competition <em>The 5 Search<\/em>, which aims to find the next big thing in acting and hosting, on 4 January 2015. The show will be hosted by Class 95FM deejay Jean Danker, and will feature Tay Ping Hui, Bryan Wong and Selena Tan as mentors.<\/p>\n <p>Then, in June, Channel 5 will launch its very first long-running serial drama consisting of 199 half-hour episodes. Keeping in line with the increase in local flavour, the series will incorporate up-to-date topics into its script by being filmed very close to its air dates. The cast and title of the drama have not yet been revealed.<\/p>\n <p>“We can build in local messages that resonate with viewers – for example, if there is haze in Singapore, we can have the father bringing home masks and teaching his children how to wear them. These are social responsibilities that we want to share,” said Bernard.<\/p>\n <p>Other changes in the overhaul include an increase in existing Current Affairs and Info-tainment shows like <em>On The Red Dot<\/em> and <em>Talking Point<\/em>, News 5 moving from 9.30pm to 9pm and the launch of a weekday pre-school belt. Viewers can also look forward to the return of home-grown favourites like <em>Code of Law 3<\/em> (5 January), <em>Spouse for House 2<\/em> (1 April), <em>Zero Calling 2<\/em> (20 April), <em>Mata Mata 3<\/em> (23 November 2015), and many more.<\/p>\n <p>&nbsp;<\/p>\n<\/div>","author":"Tammi Tan","title":"Channel 5 revamp goes for a heavier dose of local flavour","keywords":"","abstractText":"The MediaCorp English channel will roll out new programmess from January 2015","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141111T163823+0800","published":"20141111T163823+0800"}},{"id":1445760,"body":"<div>\n <p><img alt=\"方伟杰砸150万买楼  年底推出全新服装系列2.jpg\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440696\/1414546476000\/201410290933-150-2-jpg-data.jpg\" \/><br \/>Three years after his showbiz debut, one of MediaCorp’s fastest-rising stars Ian Fang was happy to announce his “small achievement” at a <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/all-the-drama-that-goes-on-in-the-actors%E2%80%99-workshop\/ss-BBbO1Rl\">training workshop helmed by Chinese actor-director Feng Yuan Zheng<\/a> on Tuesday.<br \/>The Shanghai-born actor and his mum recently moved into a condominium unit located in central Singapore. Although the S$1.5 million apartment was bought two years ago, the mother and son only shifted in this year due to renovation work which set Ian back by another five-figure sum.<br \/>“We used to pay rental for our living space and now, we’re paying for our home loan. It feels different because we have our own house now,” he shared. “In the past, I would just dump my socks <em>anywhere<\/em> after getting home. But now, I’ll arrange everything in order and even pick up a strand of hair from the floor.”<br \/>With a balcony as big as the living room, Ian’s mother has found herself new favourite hobby of enjoying the glorious view from their 28th storey unit. “There was once when she hugged me and said: ‘Son, you’ve come a really long way!’” the 25-year-old actor chuckled.<br \/><img alt=\"方伟杰砸150万买楼  年底推出全新服装系列1.jpg\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440692\/1414546495000\/201410290933-150-1-jpg-data.jpg\" \/><br \/>After his participation in Tay Ping Hui’s directorial debut <em>Meeting The Giant<\/em> and Ch8 series <em>World at Your Feet<\/em> in May, Ian, who recently returned to Singapore after filming variety shows <em>Family Wanders<\/em> and <em>Going Home<\/em> in Japan and Shanghai, has been missing in action on local TV for over six months.<br \/>Fret not, as the “duke” is set to commence filming for new drama <em>Tiger Mummy<\/em>, where he will be acting alongside Huang Biren. Also, Ian will be involved in the upcoming <em>President’s Star Charity<\/em> show on Ch5, as well as the third installment of blockbuster trilogy <em>The Journey<\/em> next year.<br \/>“I’m very happy to start filming again! It’s been a while… I think that show business is a service industry and the recipient of my services is the audience,” Ian candidly replied. “Maybe I’ve become more mature or maybe because of the financial burden after shifting house, I’m willing to take on any job that comes along now!”<br \/><img alt=\"方伟杰砸150万买楼  年底推出全新服装系列3.jpg\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440694\/1414546461000\/201410290933-150-3-jpg-data.jpg\" \/><br \/>While speaking to xinmsn, Ian also let on that he will be launching a “second product” in December. Calling the project “something that he has prepared for a long time”, the ambitious chap emphasised that he has put in a lot of effort this time round.<br \/>“It’s very different. I specially formed a team and flew to different places to source for materials and manufacturing factories,” revealed the actor.<br \/>Previously, Ian got fans excited when he hinted about his new endeavour on Instagram. In the post, the thespian showed off a little rap which sparked speculation that he might be dropping a music release. However, Ian denied the claims as his throat has yet to recover from an accident that happened during the filming of <em>Meeting The Giant<\/em>.<br \/>From the way Ian, who first launched his self-designed “First Attempt” T-shirts last year, brandished his cap in front of our cameras, it is highly likely that his new product would be a continuation of his fashion venture.<br \/><em>This interview is translated by Dang Hui Ling.<\/em><br \/><strong><a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/video\/watch\/ian-fang-needs-to-earn-as-much-as-possible-%E6%96%B9%E4%BC%9F%E6%9D%B0%E8%A6%81%E5%8A%AA%E5%8A%9B%E6%8D%9E%E9%87%91\/vi-2b848b07-f474-e710-8382-0595b67d6247\">WATCH: Why does Ian Fang need to “earn as much money as possible”?<\/a><\/strong><\/p>\n<\/div>","author":"Louis Teo","title":"Ian Fang splashes S$1.5m on new home ","keywords":"Ian Fang","abstractText":"The MediaCorp actor finally moved into his condominium home with his mum, two years after buying the unit","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141031T173450+0800","published":"20141031T173450+0800"}},{"id":1440820,"body":"<div>\n <p><img alt=\"New faces, new characters for The Journey’s sequel\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440812\/1414549004000\/201410291015-data.jpg\" \/><br \/><\/p>\n <p>Remember the closing scene of The Journey: A Voyage which featured a portrait shot of the adult actors and their young offspring in the last episode?<\/p>\n <p>Well, guess what – its following series, The Journey: Tumultuous Times, will be based on the lives of their younger generation i.e., Shitou and Yazi, Tianying and Huiniang and Tianpeng and Mingzhu’s kids – Hu Jia, Zhang Yan, Hong Dangyong, Hong Minghui and Zhangmin (we know this sounds confusing, more on them below).<\/p>\n <p>Slated for a year-end broadcast in November this year, production for the second part of The Journey trilogy is currently underway. Tumultuous Times will be set in Singapore during the 1940s to 1960s and will cover several historical events such as the Japanese occupation, the Hock Lee bus riots during our pre independence days and Singapore’s merger with Malaysia.<\/p>\n <p>For viewers who closely followed the first series, there’d be some form of continuity as the adult actors (namely Li Nanxing, Chris Tong, Joanne Peh, Allen Chen, Desmond Tan and Jeanette Aw) will return to reprise their characters in a few scenes as a lead-in to this brand new era featuring their five children.<\/p>\n <p>We’ve heard and seen your suggestions on actors who should be cast in the second series. Some wanted Rui En and Qi Yu Wu on this drama vehicle, others hoped to see Joanne and Elvin Ng return. However, Jeanette will be the only permanent addition to the cast as she is set to return and star as the grown-up edition of Yazi and Shitou’s daughter, Hong Ming Hui, in Tumultuous Times. Andie Chen also makes a return to local TV in this series and will co-star as Jeanette’s onscreen brother, Hong Dang Yong.<\/p>\n <p><img alt=\"New faces, new characters for The Journey’s sequel\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440814\/1414549012000\/201410291015-data.jpg\" \/><br \/><\/p>\n <p><em>The Journey: A Voyage's main characters and their offspring<\/em><\/p>\n <p>Other notable additions to the cast include Romeo Tan as Zhang Yan, Felicia Chin as Zhang Min, and Carrie Wong as Tang Shui Mei. Chen Hanwei will take the place of Pierre Png and Terence Cao (from the first series) to star as the show’s resident villain, Hu Wei Ren.<\/p>\n <p>The actor who is set to play Hu Jia, the son of Tian Ying and Hui Niang, is yet to be confirmed at press time.<\/p>\n <p>We understand that the sudden introduction of new characters sounds a bit mind-boggling and to simplify things, we’ve broken them down into bite-sized pieces. Here’s what you need to know about these new characters, their parents, and their entangled relationships with one another.<\/p>\n <p><em>The Journey: Tumultuous Times is slated for a year-end broadcast in 2014.<\/em><\/p>\n <p><strong>Tian Peng and Ming Zhu’s son: Zhang Yan (played by Romeo Tan)<\/strong><br \/>He is an ambitious and passionate young man filled with ideals. An excellent student in school, he also studied law in the UK and becomes a public prosecutor upon his return to Singapore. He and Dang Yong are best buddies in the show.<\/p>\n <p><strong>Tian Ying and Hui Niang’s son: Hu Jia\/Zhang Jia (actor to be confirmed)<\/strong><br \/>Originally named Zhang Jia, he was abducted by Weiren when he was 12 years old and taken under his wing – with a brand new name: Hu Jia. Quick-witted and nimble by nature, he picked up many despicable triad business dealings during his growing up years and eventually becomes a thug.<br \/><\/p>\n <p><strong>Tian Ying and Hui Niang’s adopted daughter: Zhang Min (played by Felicia Chin)<\/strong><br \/>Zhang Min was adopted by Tian Ying and Hui Niang after getting abandoned by her parents at three years old. She teaches Mandarin at a school and grows up to be the fianc&eacute;e of Dang Yong.<br \/><\/p>\n <p><strong>Shi Tou and Ya Zi’s son: Hong Dang Yong (played by Andie Chen)<\/strong><br \/>Dang Yong is good friends with Zhang Yan as they both share the same ideals. A leftist, he spearheaded many strikes and riots during the 1950s, and his fianc&eacute; is Zhang Min.<br \/><\/p>\n <p><strong>Shi Tou and Ya Zi’s daughter: Hong Ming Hui (played by Jeanette Aw)<\/strong><br \/>Min Hui is a good-natured person who believes that women are just as capable as men. A caring and kind-hearted nurse, she is Zhang Yan’s childhood sweetheart.<br \/><\/p>\n <p><img alt=\"New faces, new characters for The Journey’s sequel\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440808\/1414548946000\/201410291015-data.jpg\" \/><br \/><\/p>\n <p><strong>Tang Shui Mei (played by Carrie Wong) <\/strong><br \/>Bai Lan Xiang (nickname: Tang Shui Mei) is a hawker who sells old school desserts and is known for her bad temper and beautiful looks. Although she has endless suitors, she rejects all match-making proposals because she only has eyes for Hu Jia.<br \/><\/p>\n <p><strong>Hu Wei Ren (played by Chen Hanwei)<\/strong><br \/>A street ruffian during his teenage years, a grown-up Wei Ren turns out to be a traitor who extorts, cheats and commits all sorts of unlawful acts, and even works for the Japanese government during the occupation days. He forces Hu Jia to acknowledge him as his father after kidnapping the latter when he was a kid.<\/p>\n <p><strong>How are the characters in Tumultuous Times related?<\/strong><br \/><\/p>\n <p><strong><img alt=\"New faces, new characters for The Journey’s sequel\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1440806\/1414548979000\/201410291015-data.jpg\" \/><\/strong><br \/><\/p>\n<\/div>","author":"Joanna Goh","title":"New faces, new characters for The Journey’s sequel","keywords":"","abstractText":"The sequel to last year’s blockbuster TV series will feature new faces like Romeo Tan, Andie Chen and Felicia Chin","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141029T102207+0800","published":"20141029T102207+0800"}},{"id":1414272,"body":"<div>\n <p><img alt=\"Seeing stars with newbie actress Carrie Wong\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1414266\/1413267692000\/201410141420-carrie-data.jpg\" \/><br \/><\/p>\n <p><strong>Photos: Joanna Goh<\/strong><\/p>\n <p><br \/><\/p>\n <p>Three months ago when we first interviewed Carrie Wong at the imaging session for her maiden Ch8 project <em>Against the Tide<\/em>, the newbie actress expressed slight intimidation and apprehension at the thought of working alongside her established co-stars, Christopher (Chris) Lee and Rui En.&nbsp;<br \/><br \/>When we caught up with her at the lensing ceremony of her upcoming drama project, <em>The Journey: Tumultuous times<\/em>, Carrie sang a different tune of her co-stars – one that hinted at their strong camaraderie on set (other tell-tale signs include Carrie and her co-stars’ trigger-happy Instagram accounts as well.)<br \/><br \/>Even social-media-adverse Rui En joins in the fun too, directing a couple of “shoots” and penning a few captions for them.<br \/><br \/>“Desmond (Tan) and I have been trying to psycho her (Rui En) to get an Instagram account. But we failed,” said Carrie as she jokingly pulled a glum face. “She refuses to do it.”<br \/><br \/>What Rui En would do, however, according to Carrie, is this: “She’d tell us: ‘Let’s take a photo, but <em>YOU<\/em> post it up. And I’ll think of a caption.'”<br \/><br \/>“She enjoys doing such things,” the bright-eyed ing&eacute;nue laughed, adding that whenever Desmond and Rui En “the joker” are around, they’d never fail to fill the set with plenty of jokes and laughter.<br \/><br \/>Another co-star that Carrie looks up to and who helped tide her through her toughest crying scenes is Chris, her onscreen older brother. The long-limbed 20-year-old said&nbsp;the father-to-be&nbsp;would even tell her stories to bring out her emotions and to get her tears flowing.<\/p>\n <p><img alt=\"Seeing stars with newbie actress Carrie Wong\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1414260\/1413267735000\/201410141420-carrie2-jpg-data.jpg\" \/><br \/><\/p>\n <p>Calling him an actor she grew up watching (“I was 6 or 7 years old when I saw <em>Condor Heroes<\/em> on TV” – something most of us can attest to doing), Carrie said, “He gave me a book [to help me in my role as ‘Tang Shui Mei’ in Tumultuous Times] that is about Singapore’s nation-building years and history. In the book, there are a lot of photos from the 1940s and he told me to study how ladies from this era would behave, from their postures to their body language.”<br \/><\/p>\n <p><\/p>\n <p><\/p>\n <p><br \/>And Carrie’s on a roll working with acting heavyweights.<br \/><br \/>After Rui En and Chris, she’s set to act alongside Chen Hanwei in <em>Tumultuous Times,<\/em> as their characters are intricately linked by her onscreen childhood playmate and love interest, Hu Jia or Zhang Jia, played by Shaun Chen.<br \/><br \/>Apart from marveling at Hanwei’s jaw-dropping physical transformation into a raggedy old man, Carrie giggled uncontrollably at the mention of working with Jeanette Aw and Shaun.<br \/><\/p>\n <p>“It’s unbelievable [that I’ll be acting with them]. I saw Jing Jing and Xiao Xing (Jeanette and Shaun’s characters) 10 years ago in <em>Holland Village <\/em>when I was growing up. So being able to see them up close still feels surreal to me,” she quipped.<\/p>\n <p><br \/>So has she approached them for, uh, a selfie yet?<br \/><br \/>Giving us a similar answer like she did three months ago (at her first encounter with Rui En), she laughed in reply: “I have been trying to maintain [my composure in front of them].”<br \/><br \/>“I was really nervous when I saw Rui En too. And I didn’t dare to take photos with her initially when filming started. But now that the drama is wrapping soon, we’ve been trying to take as many photos together as possible!”<br \/><br \/>Going by the looks of it (by that we mean the amount of group pictures with Rui En on <a href=\"http:\/\/instagram.com\/carriewst\">her Instagram account<\/a>), we are pretty sure Carrie will fit in just fine. PS, we’ll be looking out for more behind-the-scenes sneak peeks in Malaysia. Keep ‘em coming, Carrie!<\/p>\n <p><img alt=\"Seeing stars with newbie actress Carrie Wong\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1414262\/1413267711000\/201410141420-carrie1-jpg-data.jpg\" \/><br \/><\/p>\n<\/div>","author":"Joanna Goh","title":"Seeing stars with newbie actress Carrie WongNewbie actress Carrie Wong gets a little star-struck on the set of local dramas","keywords":"","abstractText":"Newbie actress Carrie Wong gets a little star-struck on the set of local dramas","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141014T142604+0800","published":"20141014T142604+0800"}},{"id":1414168,"body":"<div>\n <p class=\"align--left\"><img alt=\"It is crunch time for Romeo Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1414158\/1413266602000\/201410141400-romeo-data.jpg\" \/><br \/><\/p>\n <p><strong>Photos: Joanna Goh<\/strong><\/p>\n <p><br \/><\/p>\n <p>Before he had to dive into the shoes of Zhang Yan to play a deceptive, cunning gentleman for Ch8’s year-end blockbuster series <em>The Journey: Tumultuous Times <\/em>(<em>TJTT<\/em>), Romeo Tan decided to take time off to travel, sightsee and enjoy himself to the fullest. That he did with family and friends and at a city deemed one of the world’s most romantic places – Paris.&nbsp;<br \/><br \/>When we caught up with the actor at the lensing ceremony for the drama series last Friday, Romeo revealed that his previous attempts to travel with his friends – over the past two years – fell through, and he was determined to make it happen this time round.<br \/><br \/>“I know I’d be under a lot of stress [for <em>TJTT<\/em>] when I’m back, so I decided to just relax and have fun,” said the bespectacled one, who was in Europe for a grand total of eight days.<br \/><br \/>He managed to visit Paris, Rome,&nbsp;Vatican City and Venice during his time in the EU, but Romeo said it was mostly a “touch and go” experience for him.<br \/><br \/>Apart from the overpriced coke and longer daytimes (sunset was at 10pm), Romeo was blown away by the splendor of the La Tour Eiffel at Champ de Mars. “I didn’t know the Eiffel Tower could be this romantic,” he gushed.<br \/><\/p>\n <p><br \/><\/p>\n <p>“I think you have to visit Paris with your other-half,” quipped Romeo, who believes he’d be back there again in future. “It’s too wasted if you’re not there together [with your other-half]. The Eiffel Tower is so pretty and sparkles like a diamond at night with its tiny lights. It’s like you’re watching fireworks.”<\/p>\n <p><br \/><\/p>\n <p><img alt=\"It is crunch time for Romeo Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1414246\/1413267042000\/201410141410-romeo-data.jpg\" \/><br \/><\/p>\n <p><br \/><\/p>\n <p>Having spent close to a five-figure sum on this vacation, Romeo said he did a spot of shopping and bought a few branded bags for his parents and siblings too. “They aren’t very brand conscious but I figured since I am there, I should just buy something - especially since it’s much cheaper in Europe too!”<br \/><br \/>He didn’t feel the pinch initially, but Romeo jokingly grimaced, as an afterthought: “I don’t feel that much of heartache… but… oh alright, yes [I feel the pinch]. I just saw my bill and went: ‘Ouch!’ (<em>Chuckles<\/em>)”<br \/><br \/>“But it is okay. I told myself I won’t be spending much while filming <em>Tumultuous Times<\/em>. So that’s fine,” he laughed.<\/p>\n <p><br \/><\/p>\n <p><img alt=\"It is crunch time for Romeo Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1414156\/1413266506000\/201410141400-romeo-data.jpg\" \/><br \/><\/p>\n <p>(L-R: Brandon Wong, Chen Hanwei, Desmond Tan, Shaun Chen, Jeanette Aw, Felicia Chin, Romeo Tan, Andie Chen and Carrie Wong)<\/p>\n <p><br \/><\/p>\n <p>Romeo’s days of people-watching at the sidewalks of Paris are well over for now as the actor trades gourmet coffee for mummy’s home-brewed Chinese soups and ginseng drinks &nbsp;to better prepare for his heavyweight role in <em>TJTT<\/em>. “She’d fuss over me and say: ‘Boy, are you okay? This&nbsp;is for your brain and this is to help with memorising [lines].”<br \/><br \/>The script never leaves his side, he says, and everyone at home knows it’s best to leave him alone when he’s cramming and working on his lines.<br \/><br \/>The first few days of filming were especially tough as he tried to get into character. Playing an educated scholar from the ‘50s meant Romeo had to walk and talk in a certain manner too – quite unlike his previous happy-go-lucky roles.<br \/><br \/>“Sometimes the lines are just too overwhelming because they go on for a few pages. And I have to start memorising my lines a few weeks before I film a scene too,” he quipped befire&nbsp;adding with a laugh, “Now that I think about it, the lines I had in <em>Sudden<\/em> weren’t that bad. It’s a form of training [for this!].”<br \/><br \/><em>The Journey: Tumultuous Times debuts on Ch8, Nov 24, Mondays to Fridays at 9pm.<\/em><br \/><\/p>\n<\/div>","author":"Joanna Goh","title":"It is crunch time for Romeo Tan","keywords":"","abstractText":"Romeo Tan pre-rewarded himself with a vacation in Europe before filming began for The Journey: Tumultuous Times","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141014T141611+0800","published":"20141014T141611+0800"}},{"id":1403782,"body":"<div>\n <p><img alt=\"Joanne Peh joins Qi Yuwu to headline 1965\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1403774\/1412748795000\/joanne-peh-joins-qi-yuwu-data.jpg\" \/><br \/><\/p>\n <p><br \/><\/p>\n <p><strong>Photos: Dang Hui Ling &amp; Joanna Goh<br \/>Video:<\/strong> <strong>Vina Chia &amp; Lye Yuk Sing<\/strong><br \/><br \/>After years and months of suspense and guessing – with Hong Kong thespian Tony Leung, at one point in time, suspected to be playing the revered founding father of Singapore – there is finally an answer to the whole ‘who will play Lee Kuan Yew’ mystery. And that is none other than veteran actor Lim Kay Tong, who is best remembered for his role as Charlie Tay in Channel 5’s TV series <em>Growing Up.<\/em><br \/>The big ‘Lee Kuan Yew’ reveal was finally made known to the media at the press conference held at Sheraton Towers this morning, and alongside with it, the line-up of <em>1965<\/em>’s remaining cast members was also unveiled.<br \/>Another surprise installed was the announcement of Joanne Peh’s participation in the film as Zhou Jun, a feisty coffee shop owner, following the first wave of promotions which confirmed her husband-then boyfriend Qi Yuwu and Malaysian actress Deanna Yusoff’s involvement in this SG50 project, in early September.<br \/>While Kay Tong had reservations saying ‘yes’ to the role due to his own “cowardice” playing a real-life person, for Joanne, that was not so much the case. In the roundtable interview, the actress likened her involvement in this movie to that of a courtship process between the movie’s director Randy Ang and her – one which started as early as last year.<br \/>It all began when Randy sent her the first draft of the movie’s script for perusal, she recalled. “I felt that there were some things lacking in the character and the dynamics between her character and Seng’s character (James Seah). At that time, I wouldn’t have agreed if that was the final script,” she added, emphasising that her decision to be part of this movie was in no part related to Yuwu’s role in it.<br \/>According to Joanne, Randy paid heed to her comments and feedback about the character and got back to her with subsequent drafts, which eventually led to her going on board the project.<br \/>“He put in the changes and I thought, ‘Ok, that’s making sense’ and they got serious about casting me. That’s why I agreed to do it. It’s about the story and character. It has got to be meaningful, if not I wouldn’t do it,” she added.<br \/>While it’s not known if the newly-married couple would have any scenes together (we got to ask Randy about it, she says), we know for sure that they’d be linked via the second degree as James plays Yuwu’s younger brother, Seng, and her character’s love interest.<br \/><br \/><img alt=\"Joanne Peh joins Qi Yuwu to headline 1965\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1403778\/1412748901000\/joanne-peh-joins-qi-yuwu-data.jpg\" \/><br \/><br \/>Set to hold his own against more experienced actors like Joanne and Yuwu, the 24-year-old actor shared that he’s not too worried about their first-time collaboration together. “We’re all professionals,” he replied, when asked if he was stressed about romancing Joanne in <em>1965<\/em>. “It’s more a form of good pressure, where I can learn things from them and improve my craft.”<br \/>“I’m excited to be able to partner her, an established actress, I mean – <em>woah<\/em>, in a movie some more,” he later added.<br \/>While Joanne was mostly tight-lipped about <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/qi-yuwu-and-joanne-peh-are-married\/ar-BB4GISV\">details of her hush-hush wedding to Yuwu on September 9<\/a>, preferring to “talk about it at a later date,” she did, however, share a few insights about her milestones in life and approaching this character as a married woman.<br \/><br \/><em><strong>Read on for more!<\/strong><\/em><br \/><br \/><strong>You <a target=\"_blank\" href=\"http:\/\/xin.msn.com\/en-sg\/entertainment\/celebrity\/qi-yuwu-and-joanne-peh-are-married\/ar-BB4GISV\">just got married<\/a>. Will it help you bring anything different to the movie?<\/strong><br \/>I’m not quite sure if it has got anything to do with being married but I have always wanted to focus on the craft all these while. I think the last interview I did with 8 DAYS, [I said] it’s really all about the craft and everything else is just part of life. If you ask me – life has taken me to a different stage. I’d have a lot more experience that could help, but who knows – it could also be a stumbling block because you know too much… I just want to focus on being in that moment and not knowing too much about what’s going to happen next and then react to that. That’d be the most real and genuine performance I can give this movie.<br \/><strong>How similar are you with your character?<\/strong><br \/>I’d say, the most similar thing about the two of us is we just want to do the right thing. We’re not championing any cause; we’re just following our hearts – what is the right thing to do. You’d see that in the film as well. She has aspirations, like I do. You want to make a good living, I want to make a good film – so there’s the similarity.<br \/><strong>Now that you’re entering your 30s, what’s most important to you as an actress and as a married woman?<\/strong><br \/>Time is essence as an actor. When you do a drama or movie, it takes up a lot of energy and emotions. For me, to do a project it has got to mean a lot to me. Every project I do is part of life, part of living. Going through emotions and experiences that I … it’s important now that every project I do means something and I’d have come out of it understanding myself better. Life is so much more important than work or anything else.<br \/><br \/><img alt=\"Joanne Peh joins Qi Yuwu to headline 1965\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1403776\/1412748863000\/joanne-peh-joins-qi-yuwu-data.jpg\" \/><br \/><br \/><strong>Speaking of milestones - for yourself, getting married is in itself a milestone. Have you thought about your next milestone? Like having a baby?<\/strong><br \/>I forgot to mention the similarities. The other similarity is the fact that we don’t know what’s going to happen next – just like Zhou Jun. Is she going to get married, is she going to have children? Is she going to stay in Singapore or return to China? She doesn’t know. She wants to have a family, wants to make a good living. Is it going to happen? She doesn’t know. It’s the same for me right now – a lot of things sort of take its natural course. Do I want a baby? Yes, when is it going to happen? I don’t know.<br \/><strong>On the note of courtship – how did he [Yuwu] win your hand?<\/strong><br \/>With sincerity, of course – like what Randy did with the script (<em>smiles<\/em>).<br \/><strong>One last bit on the marriage – now that you guys are registered, when would the banquet be held and are you guys planning for it now?<\/strong><br \/>Like I’ve said with the baby – I don’t know. It [the marriage] just kind of happened; it’s a natural course. Right now, I think I have a movie to worry about, I’m also going to be part of rehearsals till end of the month and I’m also going to do <em>Code of Law 3<\/em>. We have got quite a bit on our plate, so I think that’s going to be the focus for now, for this year at least. We never know what’s going to happen next year so…<br \/><strong>It feels as though you’re more about living life on a whim right now – doing what your heart tells you to do versus what you should do.<\/strong><br \/>I think now, it’s more about what my heart tells me to do, and not so much about what I should do. Because sometimes you end up doing what you should do and you’re not happy. I think it’s more important to be happy. Life is so short, time flies and gosh before you know it – I’m a year older and a year older. I’ve come to realise I got to make time mean something to me. If not what have I done when I’m going to look back? It’s really about staying true to your heart, what makes you happy, what is most meaningful to you and so I want to focus on that. I wouldn’t call it living on a whim – it’s not an irresponsible way of living, but really being responsible to yourself – which mean different things to different people.<br \/><strong>So are you happy right now?<\/strong><br \/>Of course. What can I ask for? I’m part of an important movie for Singapore [and] it’s going to happen next year with the opening of Capitol. There’s really nothing else I can ask for. Being able to sink my teeth into this role that we can have a discussion, can talk about and create chemistry with – I think any actress would jump into this.<br \/><br \/><strong>Who are you most excited to work with amongst the cast of 1965?<\/strong><br \/>Well I’m not particularly excited about working with any one person. I’m sort of just taking it easy and quite <em>c’est la vie<\/em> about it. I mean, you can’t – the things you hold on the hardest to you don’t do a good job out of it, and you lose it in fact. And sometimes the best things happen when you least expect it. I like to stick to that and let the best things happen.<br \/><br \/><em>A dramatic thriller set to premiere next year, 1965 is supported both by the Media Development Authority (MDA) and Ministry of Culture, Community and Youth (MCCY) as one of the SG50 films for 2015. It is presented by blue3 Pictures and mm2 Entertainment, produced by Daniel Yun and co-written by director Randy Ang and Andrew Ngin Chiang Meng.<\/em><\/p>\n<\/div>","author":"Joanna Goh","title":"Joanne Peh joins Qi Yuwu to headline 1965","keywords":"Joanne Peh, 1965","abstractText":"1965’s remaining cast was finally revealed today with Joanne Peh, Lim Kay Tong, James Seah, Sezairi Sezali and Mike Kasem added to the movie’s line-up","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141008T150845+0800","published":"20141008T150845+0800"}},{"id":1396728,"body":"<div>\n <p><br \/><img alt=\"When I was 21 with… Julie Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1396720\/1412334424000\/when-i-was-21-with-julie-data.jpg\" \/><br \/><br \/><strong>Photos: Julie Tan &amp; Bobby Kiran Photography<\/strong><br \/>Nothing best describes Julie Tan’s eventful year as a 21-year-old than this quote from In Memoriam A.H. H. by British Poet Alfred, Lord Tennyson: “Tis better to have loved and lost, than to have never loved before.”<br \/>The newly-minted adult, who had fell in and out of love the very same year and experienced a breakup a few weeks before her birthday, shared that her biggest takeaway was learning that “nothing lasts forever,” during a phone interview with xinmsn.<br \/>Likening her recent heartbreak episode to a form of “enlightenment,” she spoke of it with no reservations, still wearing her heart proudly on her sleeve like she did before. “We’re still friends,” she said coolly, reassuring that she has recovered from it when we checked in with her. “I think it’s more like we are going through different stages of life, and it [a breakup] is part and parcel of life,” she quipped.<br \/>And a grand birthday bash was in order to mark and celebrate this new phase in her life. Wholly planned and organised by her good friends (blogger&nbsp;Xavier Ong&nbsp;and her girl gang), Julie laughed as she recalled, “It was like my wedding - they got all my contacts from me, ran through the guest list with me and we settled on the theme – En Blanc (all white) together. All I had to do was attend and have fun. I didn’t have to do any planning!”<br \/>While most teenagers prefer to celebrate the start of adulthood at 21 years old, Julie said the numbers “22” carry more significance for her – her birthday falls on September 22 and she’s turning 22 this year – so all the more reason to celebrate turning 22, she said.<br \/>Plus, it didn’t help that she had a slight identity crisis and was unsure about what she wanted in her life and career when she was 21. “The transition of a girl becoming a lady is not easy and it was like my awkward period. But I’ve passed that stage in life already and I feel comfortable in my own skin now,” she shared.<br \/><br \/><strong>Read on as we take a trip down memory lane with Julie on her 21st year of existence on earth.<\/strong><br \/><br \/><img alt=\"When I was 21 with… Julie Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1396724\/1412334498000\/when-i-was-21-with-julie-data.jpg\" \/><br \/><br \/><strong>When I was 21, I...<\/strong> actually did whatever I wanted – I dared to love, dared to fall and took a leap of faith into the unknown. I did a lot of things and it helped me as a person, be it a painful, bad or good process. I've learned so much more and it helped me develop into a better person. Without all these I think the ‘Julie Tan’ today would be a very plain and boring person.<br \/><strong>When I was 21, I looked like...<\/strong> a girl turning into a lady (<em>laughs<\/em>). It's a very awkward period! I think I looked like neither here nor there. You want to say I’m a girl – but I’m not a ‘girl,’ you want to say I’m a woman – but I’m not yet a woman. It was an awkward period in terms of presenting myself in the way I behave and the way I act. But one day it dawned on me that I’m just 21, so why am I trying to act like I’m 25?<br \/><strong>The best thing about being 21 is... <\/strong>you'll feel like ‘I'm forever 21.’ You feel so damn young and think you can do whatever you want and yeah – ‘I'm legal man!’ I don’t need my parents’ consent now that I'm officially legal- but that’s not to say I can do illegal things – but whatever you do, you don't need your parents' consent since you’re an adult now.<br \/><strong>The worst thing about being 21 is...<\/strong> that new identity brings more stress too ‘cos you're on your own and need to take responsibility of your life. But right now I’m enjoying that process because you're in-charge of your own life and responsible for yourself. No one is responsible for you.<br \/><br \/><img alt=\"When I was 21 with… Julie Tan\" src=\"http:\/\/feeds.wcms.mediacorp.sg\/blob\/1396726\/1412334535000\/when-i-was-21-with-julie-data.jpg\" \/><br \/><br \/><strong>My 21st birthday celebration was...<\/strong> I had chili crab at home with a few friends and my parents and it was cooked by my friend’s mum. It was a simple meal at home, we nua (relaxed) at home and had crabs. And one day before my birthday, I went to Zouk with my dad and mum to countdown to my birthday too. After I turned 21, we took a family trip to Florence and spent more time with each other.<br \/><strong>The thing I remember most when I was 21 was...<\/strong> I fell really in love (<em>laughs<\/em>).<br \/><strong>I'm looking forward to turning...<\/strong> 30 (<em>laughs<\/em>). I think by then, it'd be a very different phase of life. Either I’d have a family of my own or be doing well in my career. I think it's another stage of life and I’m quite looking forward. But even though I look forward to it, I want to enjoy the process now and live every day to the fullest.<br \/><strong>If I could be 21 again, I would...<\/strong> still fall in love (<em>laughs<\/em>). I'd still dare to love, hate and dare to do what I want because you can only make mistakes when you're young. As you grow older it's harder for you to make mistakes, because it's harder to pick yourself back up.<br \/><strong>The only age better than being 21 is… <\/strong>16 <strong>because...<\/strong> I remember working so hard to get to where I am today. That period of my life was simple and all I knew was the determination to put in that much effort and hard work to be where I wanted to be. Back then I was more clueless about things and all I knew was that I needed to be very hardworking. I miss that kind of drive - not that I don't have it now, but that's a very nice feeling to have.<br \/>Actually I think I have found that feeling again recently and it makes me very focused about what I should work on.<\/p>\n<\/div>","author":"Joanna Goh","title":"When I was 21 with… Julie Tan","keywords":"Julie Tan","abstractText":"We check in with the lithe starlet, who just turned 22, on her past coming-of-age year","link":[],"categories":["Celebrity Interviews: MediaCorp stars only"],"date":{"updated":"20141003T191534+0800","published":"20141003T191534+0800"}}]}
